SELECT COUNT(*)
FROM (SELECT "Н_УЧЕНИКИ"."ИД"
      FROM "Н_УЧЕНИКИ"
               INNER JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ПЛАН_ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
               INNER JOIN "Н_ОТДЕЛЫ" ON "Н_ОТДЕЛЫ"."ОТД_ИД" = "Н_ПЛАНЫ"."ОТД_ИД"
               INNER JOIN "Н_ЛЮДИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
               INNER JOIN "Н_ВЕДОМОСТИ" ON "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" AND "ОЦЕНКА" IN ('2', '3', '4', '5')
      WHERE "Н_ОТДЕЛЫ"."КОРОТКОЕ_ИМЯ" = 'СПбГУИТМО'
      GROUP BY "Н_УЧЕНИКИ"."ИД"
      HAVING AVG(CAST("Н_ВЕДОМОСТИ"."ОЦЕНКА" AS INT)) = 5) AS ex_student