SELECT "Н_УЧЕНИКИ"."ГРУППА", "Н_ЛЮДИ"."ИД", "Н_ЛЮДИ"."ИМЯ", "Н_УЧЕНИКИ"."В_СВЯЗИ_С"
FROM "Н_ЛЮДИ"
         INNER JOIN "Н_ОБУЧЕНИЯ" ON "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
         INNER JOIN "Н_УЧЕНИКИ" ON "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
         INNER JOIN "Н_ПЛАНЫ" ON "Н_ПЛАНЫ"."ПЛАН_ИД" = "Н_УЧЕНИКИ"."ПЛАН_ИД"
         INNER JOIN "Н_НАПР_СПЕЦ" on "Н_НАПР_СПЕЦ"."ИД" = "Н_ПЛАНЫ"."НАПС_ИД"
         INNER JOIN "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД" = "Н_ПЛАНЫ"."ФО_ИД"
WHERE "Н_НАПР_СПЕЦ"."НАИМЕНОВАНИЕ" = 'Программная инженерия'
  AND "Н_ПЛАНЫ"."КУРС" = 1
  AND "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" IN ('Очная', 'Заочная')
  AND "Н_УЧЕНИКИ"."НАЧАЛО" > '2012-09-01'